# Python for Data Analysis

In [1]:
#Import Python Libraries
import numpy as np
import pandas as pd
print(np.__version__)

1.26.4

# ทบทวน

In [6]:
#Display first 20 records
df.head(20)

         rank discipline  phd  service   sex  salary
0        Prof          B   56       49  Male  186960
1        Prof          A   12        6  Male   93000
2        Prof          A   23       20  Male  110515
3        Prof          A   40       31  Male  131205
4        Prof          B   20       18  Male  104800
5        Prof          A   20       20  Male  122400
6   AssocProf          A   20       17  Male   81285
7        Prof          A   18       18  Male  126300
8        Prof          A   29       19  Male   94350
9        Prof          A   51       51  Male   57800
10       Prof          B   39       33  Male  128250
11       Prof          B   23       23  Male  134778
12   AsstProf          B    1        0  Male   88000
13       Prof          B   35       33  Male  162200
14       Prof          B   25       19  Male  153750
15       Prof          B   17        3  Male  150480
16   AsstProf          B    8        3  Male   75044
17   AsstProf          B    4        0  Male   92000
18       Prof          A   19        7  Male  107300
19       Prof          A   29       27  Male  150500

In [7]:
#Display the last 5 records
df.tail(5)

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [19]:
df[:15].mean(numeric_only=True)

phd            27.466667
service        23.800000
salary     118372.866667
dtype: float64

In [8]:
df.loc[10:20]

        rank discipline  phd  service   sex  salary
10      Prof          B   39       33  Male  128250
11      Prof          B   23       23  Male  134778
12  AsstProf          B    1        0  Male   88000
13      Prof          B   35       33  Male  162200
14      Prof          B   25       19  Male  153750
15      Prof          B   17        3  Male  150480
16  AsstProf          B    8        3  Male   75044
17  AsstProf          B    4        0  Male   92000
18      Prof          A   19        7  Male  107300
19      Prof          A   29       27  Male  150500
20  AsstProf          B    4        4  Male   92000

In [9]:
df.iloc[10:20,[0, 3, 4, 5]]

        rank  service   sex  salary
10      Prof       33  Male  128250
11      Prof       23  Male  134778
12  AsstProf        0  Male   88000
13      Prof       33  Male  162200
14      Prof       19  Male  153750
15      Prof        3  Male  150480
16  AsstProf        3  Male   75044
17  AsstProf        0  Male   92000
18      Prof        7  Male  107300
19      Prof       27  Male  150500

In [10]:
#Identify the type of df object
type(df)

pandas.core.frame.DataFrame

In [11]:
#Check the type of a column "salary"
df['salary'].dtype

dtype('int64')

In [12]:
#List the types of all columns
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [13]:
#List the column names
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [14]:
#List the row labels and the column names
df.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [15]:
#Number of dimensions
df.ndim

2

In [16]:
#Total number of elements in the Data Frame
df.size

468

In [17]:
#Number of rows and columns
df.shape

(78, 6)

In [18]:
#Output basic statistics for the numeric columns
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [19]:
#Calculate mean for all numeric columns
df.mean(numeric_only=True)

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [20]:
df.sex.head(4) #หรือ
df['sex'].head(4)

0    Male
1    Male
2    Male
3    Male
Name: sex, dtype: object

In [21]:
df[['sex']][0:9]

    sex
0  Male
1  Male
2  Male
3  Male
4  Male
5  Male
6  Male
7  Male
8  Male

In [22]:
#Calculate average of the columns in the first 50 rows
df.head(50).mean(numeric_only=True)

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [23]:
#Calculate the average salary
df['salary'].mean() #หรือ

108023.78205128205

In [24]:
np.mean(df['salary'])

108023.78205128205

In [25]:
#Calculate the basic statistics for the salary column (used describe() method)
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

### Data slicing and grouping

In [26]:
#Group data using rank  #แสดงผลข้อมูลที่ได้จากการแยกตาม rank
#df.groupby(['rank']).groups
print(df.groupby(['rank']).ngroups)
df.groupby(['rank']).mean(numeric_only=True)

3

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [27]:
#แสดงผลข้อมูลที่ได้จากการแยกตาม rank และ sex
print(df.groupby(['rank', 'sex']).ngroups)
df.groupby(['rank', 'sex']).mean(numeric_only=True) #แสดงผลค่าเฉลี่ยที่ได้จากการแยกตาม rank และ sex

6

                        phd    service         salary
rank      sex
AssocProf Female  15.500000  11.500000   88512.800000
          Male    13.666667  10.666667  102697.666667
AsstProf  Female   5.636364   2.545455   78049.909091
          Male     4.250000   1.750000   85918.000000
Prof      Female  23.722222  17.111111  121967.611111
          Male    29.214286  24.178571  124690.142857

In [28]:
df.mean(numeric_only=True)

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [29]:
#Calculate mean of all numeric columns for the grouped object
df.groupby(['rank'], sort=False).mean(numeric_only=True)

                 phd    service         salary
rank
Prof       27.065217  21.413043  123624.804348
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474

In [30]:
df_rank = df.groupby(['rank'], sort=False)
df_rank.mean(numeric_only=True)

                 phd    service         salary
rank
Prof       27.065217  21.413043  123624.804348
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474

In [31]:
df.groupby('sex').mean(numeric_only=True)

              phd    service         salary
sex
Female  16.512821  11.564103  101002.410256
Male    22.897436  18.538462  115045.153846

In [32]:
#Calculate the mean salary for men and women.  
df.groupby('sex')['salary'].mean(numeric_only=True)

sex
Female    101002.410256
Male      115045.153846
Name: salary, dtype: float64

In [33]:
# ถ้าใช้วงเล็บก้ามปูที่ attribute salary ผลลัพธ์จะแสดงออกมาเป็น dataframe
df.groupby('sex')[['salary']].mean(numeric_only=True)

               salary
sex
Female  101002.410256
Male    115045.153846

In [34]:
# Group using 2 variables - sex and rank:
df.groupby(['rank','sex'], sort=True)[['salary']].mean(numeric_only=True)

                         salary
rank      sex
AssocProf Female   88512.800000
          Male    102697.666667
AsstProf  Female   78049.909091
          Male     85918.000000
Prof      Female  121967.611111
          Male    124690.142857

---
### Example of group by

In [35]:
# Group data by the discipline and find the average salary for each group
df.groupby(['discipline'], sort=True)[['salary']].mean().round(3)   #ทศนิยม 3 ตำแหน่ง
#print(df.groupby(['discipline'], sort=True)[['salary']].mean().round(3))

                salary
discipline
A            98331.111
B           116331.786

---
### Filtering

In [36]:
#Select observation with the value in the salary column > 120K
df_sub = df[ df['salary'] > 120000]
df_sub.head()

    rank discipline  phd  service   sex  salary
0   Prof          B   56       49  Male  186960
3   Prof          A   40       31  Male  131205
5   Prof          A   20       20  Male  122400
7   Prof          A   18       18  Male  126300
10  Prof          B   39       33  Male  128250

In [37]:
#Select data for female professors
#df_w = df[ df['sex'] == 'Female']
#df_w.head()
df[ df['sex'] == 'Female']

         rank discipline  phd  service     sex  salary
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000
44       Prof          B   23       19  Female  151768
45       Prof          B   25       25  Female  140096
46   AsstProf          B   11        3  Female   74692
47  AssocProf          B   11       11  Female  103613
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
50   AsstProf          B   10        5  Female   97032
51       Prof          B   20       14  Female  127512
52       Prof          A   12        0  Female  105000
53   AsstProf          A    5        3  Female   73500
54  AssocProf          A   25       22  Female   62884
55   AsstProf          A    2        0  Female   72500
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [38]:
# Using filtering, find the mean value of the salary for the discipline A
df[df['discipline'] =='A'].mean(numeric_only=True)

phd           21.527778
service       15.722222
salary     98331.111111
dtype: float64

In [39]:
# Extract (filter) only observations with high salary ( > 100K) and find how many female and male professors in each group
df[df['salary'] > 120000].groupby('sex')['salary'].count()

sex
Female     9
Male      16
Name: salary, dtype: int64

In [40]:
#find the mean value of the salary of Woman    method 1
df[df['sex'] == "Female"].groupby('sex')['salary'].mean()

sex
Female    101002.410256
Name: salary, dtype: float64

In [41]:
#find the mean value of the salary of Woman      method 2
#df1 = df[(df['C']=='True') or (df['D']=='True')]
df[df['sex'] == 'Female']['salary'].mean().round(4) #หรือจะใช้คำสั่ง np.mean(df[df['sex'] == 'Female']['salary'])

101002.4103

In [42]:
#find the mean value of the salary of Women who has salary > 100000, use bitwise operator
df[(df['sex'] == 'Female') & (df['salary'] > 100000)] 
#df[(df['sex'] == 'Female') | (df['salary'] > 100000)]

         rank discipline  phd  service     sex  salary
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
44       Prof          B   23       19  Female  151768
45       Prof          B   25       25  Female  140096
47  AssocProf          B   11       11  Female  103613
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
51       Prof          B   20       14  Female  127512
52       Prof          A   12        0  Female  105000
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
65       Prof          A   36       19  Female  117555
69       Prof          A   28        7  Female  116450
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

---

### Missing Values

In [3]:
flights = pd.read_csv("flights.csv")
flights.tail()

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
160749,2013,9,30,2105.0,-1.0,2329.0,-25.0,UA,N477UA,475,EWR,IAH,175.0,1400,21.0,5.0
160750,2013,9,30,2121.0,21.0,2349.0,-25.0,DL,N193DN,2363,JFK,LAX,296.0,2475,21.0,21.0
160751,2013,9,30,2140.0,0.0,10.0,-30.0,AA,N335AA,185,JFK,LAX,298.0,2475,21.0,40.0
160752,2013,9,30,2149.0,-7.0,2245.0,-23.0,UA,N813UA,523,EWR,BOS,37.0,200,21.0,49.0
160753,2013,9,30,2233.0,80.0,112.0,42.0,UA,N578UA,471,EWR,SFO,318.0,2565,22.0,33.0

In [4]:
# เลือกข้อมูลที่มี missing value อย่างน้อย 1 ตัวในแต่ละแถว
flights[flights.isnull().any(axis=1)].head()

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
330,2013,1,1,1807.0,29.0,2251.0,NaN,UA,N31412,1228,EWR,SAN,NaN,2425,18.0,7.0
403,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EHAA,791,LGA,DFW,NaN,1389,NaN,NaN
404,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EVAA,1925,LGA,MIA,NaN,1096,NaN,NaN
855,2013,1,2,2145.0,16.0,NaN,NaN,UA,N12221,1299,EWR,RSW,NaN,1068,21.0,45.0
858,2013,1,2,NaN,NaN,NaN,NaN,AA,NaN,133,JFK,LAX,NaN,2475,NaN,NaN

In [45]:
# เลือก arr_delay ที่มีค่า missing value
flights1 = flights[ flights['arr_delay'].isnull( )]
flights1.head()

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
330,2013,1,1,1807.0,29.0,2251.0,NaN,UA,N31412,1228,EWR,SAN,NaN,2425,18.0,7.0
403,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EHAA,791,LGA,DFW,NaN,1389,NaN,NaN
404,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EVAA,1925,LGA,MIA,NaN,1096,NaN,NaN
855,2013,1,2,2145.0,16.0,NaN,NaN,UA,N12221,1299,EWR,RSW,NaN,1068,21.0,45.0
858,2013,1,2,NaN,NaN,NaN,NaN,AA,NaN,133,JFK,LAX,NaN,2475,NaN,NaN

In [5]:
# เลือกข้อมูลทั้งหมดที่ตัด missing value ออกไป
flights2_nomissing = flights.dropna()
flights2_nomissing

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
0,2013,1,1,517.0,2.0,830.0,11.0,UA,N14228,1545,EWR,IAH,227.0,1400,5.0,17.0
1,2013,1,1,533.0,4.0,850.0,20.0,UA,N24211,1714,LGA,IAH,227.0,1416,5.0,33.0
2,2013,1,1,542.0,2.0,923.0,33.0,AA,N619AA,1141,JFK,MIA,160.0,1089,5.0,42.0
3,2013,1,1,554.0,-6.0,812.0,-25.0,DL,N668DN,461,LGA,ATL,116.0,762,5.0,54.0
4,2013,1,1,554.0,-4.0,740.0,12.0,UA,N39463,1696,EWR,ORD,150.0,719,5.0,54.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
160749,2013,9,30,2105.0,-1.0,2329.0,-25.0,UA,N477UA,475,EWR,IAH,175.0,1400,21.0,5.0
160750,2013,9,30,2121.0,21.0,2349.0,-25.0,DL,N193DN,2363,JFK,LAX,296.0,2475,21.0,21.0
160751,2013,9,30,2140.0,0.0,10.0,-30.0,AA,N335AA,185,JFK,LAX,298.0,2475,21.0,40.0
160752,2013,9,30,2149.0,-7.0,2245.0,-23.0,UA,N813UA,523,EWR,BOS,37.0,200,21.0,49.0
160753,2013,9,30,2233.0,80.0,112.0,42.0,UA,N578UA,471,EWR,SFO,318.0,2565,22.0,33.0

In [6]:
#df2=df.dropna(subset=['Courses','Duration'])
drop_missing_dep_delay = flights.dropna(subset=['dep_delay'])
drop_missing_dep_delay

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
0,2013,1,1,517.0,2.0,830.0,11.0,UA,N14228,1545,EWR,IAH,227.0,1400,5.0,17.0
1,2013,1,1,533.0,4.0,850.0,20.0,UA,N24211,1714,LGA,IAH,227.0,1416,5.0,33.0
2,2013,1,1,542.0,2.0,923.0,33.0,AA,N619AA,1141,JFK,MIA,160.0,1089,5.0,42.0
3,2013,1,1,554.0,-6.0,812.0,-25.0,DL,N668DN,461,LGA,ATL,116.0,762,5.0,54.0
4,2013,1,1,554.0,-4.0,740.0,12.0,UA,N39463,1696,EWR,ORD,150.0,719,5.0,54.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
160749,2013,9,30,2105.0,-1.0,2329.0,-25.0,UA,N477UA,475,EWR,IAH,175.0,1400,21.0,5.0
160750,2013,9,30,2121.0,21.0,2349.0,-25.0,DL,N193DN,2363,JFK,LAX,296.0,2475,21.0,21.0
160751,2013,9,30,2140.0,0.0,10.0,-30.0,AA,N335AA,185,JFK,LAX,298.0,2475,21.0,40.0
160752,2013,9,30,2149.0,-7.0,2245.0,-23.0,UA,N813UA,523,EWR,BOS,37.0,200,21.0,49.0
160753,2013,9,30,2233.0,80.0,112.0,42.0,UA,N578UA,471,EWR,SFO,318.0,2565,22.0,33.0

In [7]:
# แสดงค่า missing value
#print("any missing", flights[ flights['dep_delay'].isnull( )].any())
print("any missing", flights[ flights['dep_delay'].isnull( )])

any missing         year  month  day  dep_time  dep_delay  arr_time  arr_delay carrier  \
403     2013      1    1       NaN        NaN       NaN        NaN      AA
404     2013      1    1       NaN        NaN       NaN        NaN      AA
858     2013      1    2       NaN        NaN       NaN        NaN      AA
859     2013      1    2       NaN        NaN       NaN        NaN      AA
860     2013      1    2       NaN        NaN       NaN        NaN      UA
...      ...    ...  ...       ...        ...       ...        ...     ...
159519  2013      9   27       NaN        NaN       NaN        NaN      US
159520  2013      9   27       NaN        NaN       NaN        NaN      UA
159854  2013      9   28       NaN        NaN       NaN        NaN      AA
159855  2013      9   28       NaN        NaN       NaN        NaN      US
160286  2013      9   29       NaN        NaN       NaN        NaN      UA

       tailnum  flight origin dest  air_time  distance  hour  minute
403     N3EHAA     791    LGA  DFW       NaN      1389   NaN     NaN
404     N3EVAA    1925    LGA  MIA       NaN      1096   NaN     NaN
858        NaN     133    JFK  LAX       NaN      2475   NaN     NaN
859     N3FBAA     753    LGA  DFW       NaN      1389   NaN     NaN
860        NaN     623    EWR  ORD       NaN       719   NaN     NaN
...        ...     ...    ...  ...       ...       ...   ...     ...
159519     NaN    2164    LGA  BOS       NaN       184   NaN     NaN
159520     NaN     269    LGA  ORD       NaN       733   NaN     NaN
159854  N320AA       1    JFK  LAX       NaN      2475   NaN     NaN
159855     NaN     581    EWR  CLT       NaN       529   NaN     NaN
160286     NaN     331    LGA  ORD       NaN       733   NaN     NaN

[2336 rows x 16 columns]

In [49]:
# เปลี่ยนค่า missing values ของ dep_delay ด้วยค่าศูนย์
print("any missing after fill missing",flights['dep_delay'].fillna(0).isnull().any())
#nomiss =flights['dep_delay'].fillna(0)
#nomiss.isnull().any()  # ตรวจสอบว่า nomiss เป็น null หรือไม่ จะให้ค่า True or False ถ้าเป็น null จะมีค่าเป็น true

any missing after fill missing False

In [50]:
# เปลี่ยนค่า missing values ของ dep_delay ด้วยค่าเฉลี่ยของ dep_delay
mean_dep_delay = flights['dep_delay'].mean() #หรือจะใช้คำสั่ง mean_dep_delay = np.mean(flights['dep_delay'])
average_nomiss =flights['dep_delay'].fillna(mean_dep_delay) #หรือจะใช้คำสั่ง flights['dep_delay'].fillna(flights['dep_delay'].mean())
average_nomiss

0          2.0
1          4.0
2          2.0
3         -6.0
4         -4.0
          ...
160749    -1.0
160750    21.0
160751     0.0
160752    -7.0
160753    80.0
Name: dep_delay, Length: 160754, dtype: float64

In [8]:
# นับจำนวน missing values ที่อยู่ในแต่ละ dep_delay, arr_delay attribute
flights[['dep_delay','arr_delay']].isnull().sum()

dep_delay    2336
arr_delay    2827
dtype: int64

In [9]:
#นับจำนวน missing value ของ dep_delay และ arr_delay ทั้งหมด
flights[['dep_delay','arr_delay']].isnull().sum().sum()

5163

In [53]:
# Find the number of non-missing values in each column
# นับจำนวนที่ไม่ใช่ missing value ของแต่ละ attribute
flights.count()

year         160754
month        160754
day          160754
dep_time     158418
dep_delay    158418
arr_time     158275
arr_delay    157927
carrier      160754
tailnum      159321
flight       160754
origin       160754
dest         160754
air_time     157927
distance     160754
hour         158418
minute       158418
dtype: int64

In [54]:
# Count the number of records for each different value in a vector
#เหมือน flights.groupby('carrier')['carrier'].count()
flights['carrier'].value_counts()

carrier
UA    58665
DL    48110
AA    32729
US    20536
AS      714
Name: count, dtype: int64

In [55]:
flights['carrier'].count()

160754